Tekla.Structures.CatalogInternal.dotcatProfileItemEnumerator_t
Serialization structure for Profile Item Enumerator

Tekla.Structures.CatalogInternal.dotcatProfileItemEnumerator_t.MoreProfilesItemsLeft
DO NOT USE! For internal usage only!

Tekla.Structures.CatalogInternal.dotcatProfileItemEnumerator_t.IndexToStart
DO NOT USE! For internal usage only!

Tekla.Structures.CatalogInternal.dotcatProfileItemEnumerator_t.nProfileItems
Number of the profile items in the enumerator.

Tekla.Structures.CatalogInternal.dotcatProfileItemEnumerator_t.ProfileEnumeratorType
Tells if it enumerates all the profiles, library or parametric.
Currently only Library Profiles are supported.

Tekla.Structures.CatalogInternal.dotcatProfileItemEnumerator_t.aProfileItemNames
Profile names list.

Tekla.Structures.CatalogInternal.dotcatProfileItemEnumerator_t.aProfileItemTypes
Profile types list.

Tekla.Structures.CatalogInternal.dotcatProfileItemEnumerator_t.aProfileItemProfileTypes
Profile types list.

Tekla.Structures.CatalogInternal.dotcatProfileItemEnumerator_t.FillTreePaths
Tells if Profile tree list is filled in enumerator.

Tekla.Structures.CatalogInternal.dotcatProfileItemEnumerator_t.aProfileTreePaths
Profile tree list.

Tekla.Structures.CatalogInternal.dotcatProfileItemEnumerator_t.ClientId
DO NOT USE! For internal usage only!